Physics/Review.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:0 h:2 toc:1
# num:0 = dont number any, h:2 = headings to level 2, toc:1 = only put a table of contents to level 1
#+TITLE:     Physics All Subjects notes
#+AUTHOR:    Alex Burns
# EXPORT = C-c C-e h h

# https://github.com/fniessen/refcard-org-mode
# https://orgmode.org/worg/org-symbols.html
# /Emphasize/ (italics), *strongly* (bold), and */very strongly/* (bold italics).
# num:1 = numbering up to level 1 heading; num:nil = numbering for all headings

* Kinematics
** Equations
 $x=\frac12at^2$ \\
 $a=v/t$ \\
 $V^2=v^2+2ax$ \\
 $V=d/t$ \\
 $\Delta d=\frac12(v_f+v_i) \Delta t$ \\
** Graphs
** Practice Problems
- How do we calculate speed? Or velocity?
- What do distance versus time graphs show? What do the different slopes mean?
- What is acceleration?
- When do you use d=st to solve for distance, and when do you have to use x=1/2at2?
- When do you use s=d/t to solve for speed, and when do you have to use v=at?
- If we have a curved line when we graph data (like on a distance vs time graph when an object is accelerating), what are the three different ways we can determine speed at a certain point?
- How can we use the idea of freefall (g=-10m/s2) to solve problems for falling objects?
- How can we determine the distance a projectile travels if we know the initial conditions of the object?
- What do we know about the horizontal and vertical components of a projectile as it travels?

* Forces
** Big Ideas
- A force is a psuh or a pull on an object
- Adding up all of the forces on an object will give you the total (*NET*) force on the object
- If there is a net force acting on an object, the object will accelerate; if there is no net force the object will maintain a constant (and possibly zero) velocity
- We can think of forces acting on individual objects or an entire "system" of objects. In either case, Newton's 2nd Law: F=ma, still applies
- Linking forces to other physics topics:
  - Kinematics: Forces cause accelerations or changes in velocity
  - Momentum: Forces cause changes in momentum (impulses)
  -  Energy: Forces act on objects to change the kinetic energy through doing work on such objects
  - Oscillations: Forces can oppose motion. When this happens an object will oscillate around a fixed point
  - Rotation: Forces causing rotations act at a distance "r" from the point of rotation and are called "torques"
** What do I really need to remember for the test?
- You should be able to correctly identify which forces are acting on an object (or a system) at any moment. Remeber, the forces include: gravity, friction, normal, tension, and applied. Generally, air resistance is negligible
- Make sure you can correctly draw a force diagram. Your force vectors should be drawn neatly and to scale, starting on the object and poitning outward
- Take a moment to think about which force is larger for a problem without applying any math. Many times students will assume certain relationships that are common, but not always true.  For instance, the normal is often, but not always, equal to gravity.  For a block hangin by a string, tension may or may not be equal to gravity.  Double check the problem carefully!
- Always start mathematical operations with an equation from the formula sheet.  If you are looking for gravity or friction use Fg=mg and f=μN, respectively.  Solving for centripetal force or the gravitational force between planets, use their respective equations.  If you see a block on a ramp and you say F(II)=mg $\sin(\theta)$ you will lose points as you have not shown where this equation came from and how it is derived.
** Equations
*** General
$F=ma$ \\
$Fg=mg$ \\
*** Elevator
$T-Fg=ma$ \\
*** Ramps
$F_N=mg\cos(\theta)$ \\
$F(II)=mg\sin(\theta)$ \\
$F_f=uN=umg\cos(\theta)$ \\
$tan(\theta)=u$ \\
** Graphs
