Physics/Review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-23 Fri 10:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Physics All Subjects notes</title>
<meta name="author" content="Alex Burns" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Physics All Subjects notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgad91fed">Kinematics</a></li>
<li><a href="#org125509b">Forces</a></li>
<li><a href="#orgdee0da0">Gravity/Circular Motion</a></li>
<li><a href="#orgb8cd4aa">Energy</a></li>
<li><a href="#org9626431">Momentum</a></li>
<li><a href="#org75f85b6">Oscillations &amp; Waves</a></li>
<li><a href="#org4a821c4">Rotation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgad91fed" class="outline-2">
<h2 id="orgad91fed">Kinematics</h2>
<div class="outline-text-2" id="text-orgad91fed">
</div>
<div id="outline-container-org3f71b18" class="outline-3">
<h3 id="org3f71b18">Equations</h3>
<div class="outline-text-3" id="text-org3f71b18">
<p>
\(x=\frac12at^2\) <br />
\(a=v/t\) <br />
\(V^2=v^2+2ax\) <br />
\(V=d/t\) <br />
\(\Delta d=\frac12(v_f+v_i) \Delta t\) <br />
</p>
</div>
</div>
<div id="outline-container-orgdf2f1d7" class="outline-3">
<h3 id="orgdf2f1d7">Graphs</h3>
</div>
<div id="outline-container-org01c6d07" class="outline-3">
<h3 id="org01c6d07">Practice Problems</h3>
<div class="outline-text-3" id="text-org01c6d07">
<ul class="org-ul">
<li>How do we calculate speed? Or velocity?</li>
<li>What do distance versus time graphs show? What do the different slopes mean?</li>
<li>What is acceleration?</li>
<li>When do you use d=st to solve for distance, and when do you have to use x=1/2at2?</li>
<li>When do you use s=d/t to solve for speed, and when do you have to use v=at?</li>
<li>If we have a curved line when we graph data (like on a distance vs time graph when an object is accelerating), what are the three different ways we can determine speed at a certain point?</li>
<li>How can we use the idea of freefall (g=-10m/s2) to solve problems for falling objects?</li>
<li>How can we determine the distance a projectile travels if we know the initial conditions of the object?</li>
<li>What do we know about the horizontal and vertical components of a projectile as it travels?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org125509b" class="outline-2">
<h2 id="org125509b">Forces</h2>
<div class="outline-text-2" id="text-org125509b">
</div>
<div id="outline-container-orgf275d81" class="outline-3">
<h3 id="orgf275d81">Big Ideas</h3>
<div class="outline-text-3" id="text-orgf275d81">
<ul class="org-ul">
<li>A force is a psuh or a pull on an object</li>
<li>Adding up all of the forces on an object will give you the total (<b>NET</b>) force on the object</li>
<li>If there is a net force acting on an object, the object will accelerate; if there is no net force the object will maintain a constant (and possibly zero) velocity</li>
<li>We can think of forces acting on individual objects or an entire &ldquo;system&rdquo; of objects. In either case, Newton&rsquo;s 2nd Law: F=ma, still applies</li>
<li>Linking forces to other physics topics:
<ul class="org-ul">
<li>Kinematics: Forces cause accelerations or changes in velocity</li>
<li>Momentum: Forces cause changes in momentum (impulses)</li>
<li>Energy: Forces act on objects to change the kinetic energy through doing work on such objects</li>
<li>Oscillations: Forces can oppose motion. When this happens an object will oscillate around a fixed point</li>
<li>Rotation: Forces causing rotations act at a distance &ldquo;r&rdquo; from the point of rotation and are called &ldquo;torques&rdquo;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6090c95" class="outline-3">
<h3 id="org6090c95">What do I really need to remember for the test?</h3>
<div class="outline-text-3" id="text-org6090c95">
<ul class="org-ul">
<li>You should be able to correctly identify which forces are acting on an object (or a system) at any moment. Remeber, the forces include: gravity, friction, normal, tension, and applied. Generally, air resistance is negligible</li>
<li>Make sure you can correctly draw a force diagram. Your force vectors should be drawn neatly and to scale, starting on the object and poitning outward</li>
<li>Take a moment to think about which force is larger for a problem without applying any math. Many times students will assume certain relationships that are common, but not always true.  For instance, the normal is often, but not always, equal to gravity.  For a block hangin by a string, tension may or may not be equal to gravity.  Double check the problem carefully!</li>
<li>Always start mathematical operations with an equation from the formula sheet.  If you are looking for gravity or friction use Fg=mg and f=μN, respectively.  Solving for centripetal force or the gravitational force between planets, use their respective equations.  If you see a block on a ramp and you say F(II)=mg \(\sin(\theta)\) you will lose points as you have not shown where this equation came from and how it is derived.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc0aaa94" class="outline-3">
<h3 id="orgc0aaa94">Equations</h3>
<div class="outline-text-3" id="text-orgc0aaa94">
</div>
<ul class="org-ul">
<li><a id="orgafa4971"></a>General<br />
<div class="outline-text-4" id="text-orgafa4971">
<p>
\(F=ma\) <br />
\(Fg=mg\) <br />
</p>
</div>
</li>
<li><a id="org7f41b64"></a>Elevator<br />
<div class="outline-text-4" id="text-org7f41b64">
<p>
\(T-Fg=ma\) <br />
</p>
</div>
</li>
<li><a id="orga660393"></a>Ramps<br />
<div class="outline-text-4" id="text-orga660393">
<p>
\(F_N=mg\cos(\theta)\) <br />
\(F(II)=mg\sin(\theta)\) <br />
\(F_f=uN=umg\cos(\theta)\) <br />
\(tan(\theta)=u\) <br />
</p>
</div>
</li>
</ul>
</div>
