Physics/Review.tex
% Created 2021-05-02 Sun 14:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setcounter{secnumdepth}{0}
\author{Alex Burns}
\date{\today}
\title{Physics All Subjects notes}
\hypersetup{
 pdfauthor={Alex Burns},
 pdftitle={Physics All Subjects notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{1}
\tableofcontents


\section*{Kinematics}
\label{sec:org7a8e614}
\subsection*{Equations}
\label{sec:orgbf2488c}
\(x=\frac12at^2\) \\
\(a=v/t\) \\
\(V^2=v^2+2ax\) \\
\(V=d/t\) \\
\(\Delta d=\frac12(v_f+v_i) \Delta t\) \\
\subsection*{Graphs}
\label{sec:org51c14a5}
\subsection*{Practice Problems}
\label{sec:org90ac3e4}
\begin{itemize}
\item How do we calculate speed? Or velocity?
\item What do distance versus time graphs show? What do the different slopes mean?
\item What is acceleration?
\item When do you use d=st to solve for distance, and when do you have to use x=1/2at2?
\item When do you use s=d/t to solve for speed, and when do you have to use v=at?
\item If we have a curved line when we graph data (like on a distance vs time graph when an object is accelerating), what are the three different ways we can determine speed at a certain point?
\item How can we use the idea of freefall (g=-10m/s2) to solve problems for falling objects?
\item How can we determine the distance a projectile travels if we know the initial conditions of the object?
\item What do we know about the horizontal and vertical components of a projectile as it travels?
\end{itemize}

\section*{Forces}
\label{sec:orgd488dfd}
\subsection*{Big Ideas}
\label{sec:org396ff48}
\begin{itemize}
\item A force is a psuh or a pull on an object
\item Adding up all of the forces on an object will give you the total (\textbf{NET}) force on the object
\item If there is a net force acting on an object, the object will accelerate; if there is no net force the object will maintain a constant (and possibly zero) velocity
\item We can think of forces acting on individual objects or an entire ``system'' of objects. In either case, Newton's 2nd Law: F=ma, still applies
\item Linking forces to other physics topics:
\begin{itemize}
\item Kinematics: Forces cause accelerations or changes in velocity
\item Momentum: Forces cause changes in momentum (impulses)
\item Energy: Forces act on objects to change the kinetic energy through doing work on such objects
\item Oscillations: Forces can oppose motion. When this happens an object will oscillate around a fixed point
\item Rotation: Forces causing rotations act at a distance ``r'' from the point of rotation and are called ``torques''
\end{itemize}
\end{itemize}
\subsection*{What do I really need to remember for the test?}
\label{sec:org1199ff5}
\begin{itemize}
\item You should be able to correctly identify which forces are acting on an object (or a system) at any moment. Remeber, the forces include: gravity, friction, normal, tension, and applied. Generally, air resistance is negligible
\item Make sure you can correctly draw a force diagram. Your force vectors should be drawn neatly and to scale, starting on the object and poitning outward
\item Take a moment to think about which force is larger for a problem without applying any math. Many times students will assume certain relationships that are common, but not always true.  For instance, the normal is often, but not always, equal to gravity.  For a block hangin by a string, tension may or may not be equal to gravity.  Double check the problem carefully!
\item Always start mathematical operations with an equation from the formula sheet.  If you are looking for gravity or friction use Fg=mg and f=μN, respectively.  Solving for centripetal force or the gravitational force between planets, use their respective equations.  If you see a block on a ramp and you say F(II)=mg \(\sin(\theta)\) you will lose points as you have not shown where this equation came from and how it is derived.
\end{itemize}
