Physics/Review.org
** Practice Problems
- What are Newton’s three laws?
- If an object has a=0, what else must be true? (There are 4 things)
- What does it mean when forces are balanced? Or equilibrium?
- How does the force applied on object A by object B compare to the one applied by object B on object A? (Which law is that?)
- How does net force relate to acceleration?
- How is normal force determined?
- What are some examples of situations in which the normal force is not equal to an object’s weight?
- When should you consider breaking forces up into component?

* Gravity/Circular Motion
** Equations
$F_G=G(m_1m_2)/r^2$ \\
$F_c=mv^2/r$ \\
$T^2=(4\pi ^2/GM)r^3$ \\
** Graphs
** Practice Problems
- If something is moving in a circle, what must be true about the net force on it? The acceleration?
- What do we call the net force acting on an object travelling in a circle?
- How do we calculate Fc? How does it change if we increase the mass?  The velocity? The radius?
- The Fc is always caused by some force (or sum of forces). For example, for the moon going around the sun, the Fc is caused by gravity. It can be a single force, a component of one force, or the sum of multiple forces. Give an example of each.
- How does the centripetal force change when a roller coaster is at the top of a loop versus at the bottom of a loop?
- What caused the centripetal force on the toy airplane in the lab we did? How did we determine the magnitude (value) of the radius and of the centripetal force?
- How is the force of gravity between two planets affected by their masses? Their distance apart?
- How is the big equation for gravity (Gmm/r2) related to the weight equation (F=mg)?
* Energy
** Equations
$PE=mgh$ \\
$KE=\frac12 mv^2$ \\
$KE(ROT)=\frac12Iw^2$ \\
$U_s=\frac12kx^2$ \\
$W=Fx\cos(\theta)$ \\
** Graphs
** Practice Problems
- What is “work” in a physics context?  How is it related to the outside force?
- When does someone do more work or less?
- How is work related to energy?
- How do you determine gravitational PE?
- How do you determine kinetic energy?
- What does it mean to say that energy is conserved? Or transferred?
- How are KE and PE related? (How is the height an object begins at related to its speed at h=0?)
- What is power and how does it relate to energy?
- How can elastic energy convert into kinetic energy? Or potential?
* Momentum
** Equations
$p=mv$ \\
$\Delta p =m \Delta v$ \\
$\Delta p = F \Delta t$ \\
$m_1v_1+m_2v_2=m_1v_1^\prime + m_2v_2^\prime$ \\
$\frac12 m_1v_1^2+\frac12m_2v_2^2 = \frac12 m_1v_1^2 + m_2v_2^2$ \\
** Graphs
** Practice Problems
- How do you determine momentum?
- What does it mean to say that momentum is conserved?
- What is the difference between elastic and inelastic collisions?
- What is true about the forces on the two objects that are colliding (regardless of mass!)?
- What is Impulse?
- How is impulse related to the outside force?
* Oscillations & Waves
** Equations
$T=2\pi\sqrt{L/g}$ \\
$T=2\pi\sqrt{m/k}$ \\
$T=1/f$ \\
** Graphs
** Practice Problems
- What is an oscillation?  What are some common examples of oscillations?
- What factors determine the time it takes for things to oscillate (springs and pendulums)
- What is a wave?  What are some examples of waves?  How are waves organized?
- Compare and contrast different types of waves.
- How are the various wave characteristics related?  (ie… period, frequency, wavelength, and wave speed)
- What are some characteristics of sound waves and light waves?
- How are open-ended tubes similar and different from closed-ended tubes?
- How does your eye perceive color?
- How do colors mix with light as compared to pigments?
* Rotation
** Equations
*** Torque
$\tau=Fr\sin(\theta)$ \\
$\tau=I\alpha$ \\
$I=kmR^2$ \\
*** Connecting
$x=R\theta$ \\
$v=R\omega$ \\
$a=R\alpha$ \\
