Physics/Review.html
<div id="outline-container-orge59e0db" class="outline-3">
<h3 id="orge59e0db">Graphs</h3>
</div>
<div id="outline-container-org341f050" class="outline-3">
<h3 id="org341f050">Practice Problems</h3>
<div class="outline-text-3" id="text-org341f050">
<ul class="org-ul">
<li>What are Newton’s three laws?</li>
<li>If an object has a=0, what else must be true? (There are 4 things)</li>
<li>What does it mean when forces are balanced? Or equilibrium?</li>
<li>How does the force applied on object A by object B compare to the one applied by object B on object A? (Which law is that?)</li>
<li>How does net force relate to acceleration?</li>
<li>How is normal force determined?</li>
<li>What are some examples of situations in which the normal force is not equal to an object’s weight?</li>
<li>When should you consider breaking forces up into component?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdee0da0" class="outline-2">
<h2 id="orgdee0da0">Gravity/Circular Motion</h2>
<div class="outline-text-2" id="text-orgdee0da0">
</div>
<div id="outline-container-org856f4c8" class="outline-3">
<h3 id="org856f4c8">Equations</h3>
<div class="outline-text-3" id="text-org856f4c8">
<p>
\(F_G=G(m_1m_2)/r^2\) <br />
\(F_c=mv^2/r\) <br />
\(T^2=(4\pi ^2/GM)r^3\) <br />
</p>
</div>
</div>
<div id="outline-container-orgd03ecdb" class="outline-3">
<h3 id="orgd03ecdb">Graphs</h3>
</div>
<div id="outline-container-org5432ad6" class="outline-3">
<h3 id="org5432ad6">Practice Problems</h3>
<div class="outline-text-3" id="text-org5432ad6">
<ul class="org-ul">
<li>If something is moving in a circle, what must be true about the net force on it? The acceleration?</li>
<li>What do we call the net force acting on an object travelling in a circle?</li>
<li>How do we calculate Fc? How does it change if we increase the mass?  The velocity? The radius?</li>
<li>The Fc is always caused by some force (or sum of forces). For example, for the moon going around the sun, the Fc is caused by gravity. It can be a single force, a component of one force, or the sum of multiple forces. Give an example of each.</li>
<li>How does the centripetal force change when a roller coaster is at the top of a loop versus at the bottom of a loop?</li>
<li>What caused the centripetal force on the toy airplane in the lab we did? How did we determine the magnitude (value) of the radius and of the centripetal force?</li>
<li>How is the force of gravity between two planets affected by their masses? Their distance apart?</li>
<li>How is the big equation for gravity (Gmm/r2) related to the weight equation (F=mg)?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb8cd4aa" class="outline-2">
<h2 id="orgb8cd4aa">Energy</h2>
<div class="outline-text-2" id="text-orgb8cd4aa">
</div>
<div id="outline-container-org4caead9" class="outline-3">
<h3 id="org4caead9">Equations</h3>
<div class="outline-text-3" id="text-org4caead9">
<p>
\(PE=mgh\) <br />
\(KE=\frac12 mv^2\) <br />
\(KE(ROT)=\frac12Iw^2\) <br />
\(U_s=\frac12kx^2\) <br />
\(W=Fx\cos(\theta)\) <br />
</p>
</div>
</div>
<div id="outline-container-orge911298" class="outline-3">
<h3 id="orge911298">Graphs</h3>
</div>
<div id="outline-container-orgfff2ede" class="outline-3">
<h3 id="orgfff2ede">Practice Problems</h3>
<div class="outline-text-3" id="text-orgfff2ede">
<ul class="org-ul">
<li>What is “work” in a physics context?  How is it related to the outside force?</li>
<li>When does someone do more work or less?</li>
<li>How is work related to energy?</li>
<li>How do you determine gravitational PE?</li>
<li>How do you determine kinetic energy?</li>
<li>What does it mean to say that energy is conserved? Or transferred?</li>
<li>How are KE and PE related? (How is the height an object begins at related to its speed at h=0?)</li>
<li>What is power and how does it relate to energy?</li>
<li>How can elastic energy convert into kinetic energy? Or potential?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9626431" class="outline-2">
<h2 id="org9626431">Momentum</h2>
<div class="outline-text-2" id="text-org9626431">
</div>
<div id="outline-container-org233c61e" class="outline-3">
<h3 id="org233c61e">Equations</h3>
<div class="outline-text-3" id="text-org233c61e">
<p>
\(p=mv\) <br />
\(\Delta p =m \Delta v\) <br />
\(\Delta p = F \Delta t\) <br />
\(m_1v_1+m_2v_2=m_1v_1^\prime + m_2v_2^\prime\) <br />
\(\frac12 m_1v_1^2+\frac12m_2v_2^2 = \frac12 m_1v_1^2 + m_2v_2^2\) <br />
</p>
</div>
</div>
<div id="outline-container-orgc346120" class="outline-3">
<h3 id="orgc346120">Graphs</h3>
</div>
<div id="outline-container-org789bcda" class="outline-3">
<h3 id="org789bcda">Practice Problems</h3>
<div class="outline-text-3" id="text-org789bcda">
<ul class="org-ul">
<li>How do you determine momentum?</li>
<li>What does it mean to say that momentum is conserved?</li>
<li>What is the difference between elastic and inelastic collisions?</li>
<li>What is true about the forces on the two objects that are colliding (regardless of mass!)?</li>
<li>What is Impulse?</li>
<li>How is impulse related to the outside force?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org75f85b6" class="outline-2">
<h2 id="org75f85b6">Oscillations &amp; Waves</h2>
<div class="outline-text-2" id="text-org75f85b6">
</div>
<div id="outline-container-org109fe04" class="outline-3">
<h3 id="org109fe04">Equations</h3>
<div class="outline-text-3" id="text-org109fe04">
<p>
\(T=2\pi\sqrt{L/g}\) <br />
\(T=2\pi\sqrt{m/k}\) <br />
\(T=1/f\) <br />
</p>
</div>
</div>
<div id="outline-container-org050d4cb" class="outline-3">
<h3 id="org050d4cb">Graphs</h3>
</div>
<div id="outline-container-org0892b81" class="outline-3">
<h3 id="org0892b81">Practice Problems</h3>
<div class="outline-text-3" id="text-org0892b81">
<ul class="org-ul">
<li>What is an oscillation?  What are some common examples of oscillations?</li>
<li>What factors determine the time it takes for things to oscillate (springs and pendulums)</li>
<li>What is a wave?  What are some examples of waves?  How are waves organized?</li>
<li>Compare and contrast different types of waves.</li>
<li>How are the various wave characteristics related?  (ie… period, frequency, wavelength, and wave speed)</li>
<li>What are some characteristics of sound waves and light waves?</li>
<li>How are open-ended tubes similar and different from closed-ended tubes?</li>
<li>How does your eye perceive color?</li>
<li>How do colors mix with light as compared to pigments?</li>
</ul>
</div>
</div>
</div>
