Physics/Review.tex
\subsection*{Equations}
\label{sec:orgfe450df}
\begin{itemize}
\item General
\label{sec:org79ccd0c}
\(F=ma\) \\
\(Fg=mg\) \\
\item Elevator
\label{sec:org99f4580}
\(T-Fg=ma\) \\
\item Ramps
\label{sec:orgfb7fff2}
\(F_N=mg\cos(\theta)\) \\
\(F(II)=mg\sin(\theta)\) \\
\(F_f=uN=umg\cos(\theta)\) \\
\(tan(\theta)=u\) \\
\end{itemize}
\subsection*{Graphs}
\label{sec:org7907e4c}
\subsection*{Practice Problems}
\label{sec:org40210a3}
\begin{itemize}
\item What are Newton’s three laws?
\item If an object has a=0, what else must be true? (There are 4 things)
\item What does it mean when forces are balanced? Or equilibrium?
\item How does the force applied on object A by object B compare to the one applied by object B on object A? (Which law is that?)
\item How does net force relate to acceleration?
\item How is normal force determined?
\item What are some examples of situations in which the normal force is not equal to an object’s weight?
\item When should you consider breaking forces up into component?
\end{itemize}

\section*{Gravity/Circular Motion}
\label{sec:org5205031}
\subsection*{Equations}
\label{sec:org8e69145}
\(F_G=G(m_1m_2)/r^2\) \\
\(F_c=mv^2/r\) \\
\(T^2=(4\pi ^2/GM)r^3\) \\
\subsection*{Graphs}
\label{sec:org7bc4bf7}
\subsection*{Practice Problems}
\label{sec:org26851be}
\begin{itemize}
\item If something is moving in a circle, what must be true about the net force on it? The acceleration?
\item What do we call the net force acting on an object travelling in a circle?
\item How do we calculate Fc? How does it change if we increase the mass?  The velocity? The radius?
\item The Fc is always caused by some force (or sum of forces). For example, for the moon going around the sun, the Fc is caused by gravity. It can be a single force, a component of one force, or the sum of multiple forces. Give an example of each.
\item How does the centripetal force change when a roller coaster is at the top of a loop versus at the bottom of a loop?
\item What caused the centripetal force on the toy airplane in the lab we did? How did we determine the magnitude (value) of the radius and of the centripetal force?
\item How is the force of gravity between two planets affected by their masses? Their distance apart?
\item How is the big equation for gravity (Gmm/r2) related to the weight equation (F=mg)?
\end{itemize}
\section*{Energy}
\label{sec:org1b82133}
\subsection*{Equations}
\label{sec:orgbc4cb09}
\(PE=mgh\) \\
\(KE=\frac12 mv^2\) \\
\(KE(ROT)=\frac12Iw^2\) \\
\(U_s=\frac12kx^2\) \\
\(W=Fx\cos(\theta)\) \\
\subsection*{Graphs}
\label{sec:orgee64a3b}
\subsection*{Practice Problems}
\label{sec:org5794f86}
\begin{itemize}
\item What is “work” in a physics context?  How is it related to the outside force?
\item When does someone do more work or less?
\item How is work related to energy?
\item How do you determine gravitational PE?
\item How do you determine kinetic energy?
\item What does it mean to say that energy is conserved? Or transferred?
\item How are KE and PE related? (How is the height an object begins at related to its speed at h=0?)
\item What is power and how does it relate to energy?
\item How can elastic energy convert into kinetic energy? Or potential?
\end{itemize}
\section*{Momentum}
\label{sec:orgdab7561}
\subsection*{Equations}
\label{sec:org24f08d2}
\(p=mv\) \\
\(\Delta p =m \Delta v\) \\
\(\Delta p = F \Delta t\) \\
\(m_1v_1+m_2v_2=m_1v_1^\prime + m_2v_2^\prime\) \\
\(\frac12 m_1v_1^2+\frac12m_2v_2^2 = \frac12 m_1v_1^2 + m_2v_2^2\) \\
\subsection*{Graphs}
\label{sec:orgc94d761}
\subsection*{Practice Problems}
\label{sec:org215e136}
\begin{itemize}
\item How do you determine momentum?
\item What does it mean to say that momentum is conserved?
\item What is the difference between elastic and inelastic collisions?
\item What is true about the forces on the two objects that are colliding (regardless of mass!)?
\item What is Impulse?
\item How is impulse related to the outside force?
\end{itemize}
\section*{Oscillations \& Waves}
\label{sec:org90907f7}
\subsection*{Equations}
\label{sec:org4ebd0ef}
\(T=2\pi\sqrt{L/g}\) \\
\(T=2\pi\sqrt{m/k}\) \\
\(T=1/f\) \\
\subsection*{Graphs}
\label{sec:org7ff4999}
\subsection*{Practice Problems}
\label{sec:org319c62f}
\begin{itemize}
\item What is an oscillation?  What are some common examples of oscillations?
\item What factors determine the time it takes for things to oscillate (springs and pendulums)
\item What is a wave?  What are some examples of waves?  How are waves organized?
\item Compare and contrast different types of waves.
\item How are the various wave characteristics related?  (ie… period, frequency, wavelength, and wave speed)
\item What are some characteristics of sound waves and light waves?
\item How are open-ended tubes similar and different from closed-ended tubes?
\item How does your eye perceive color?
\item How do colors mix with light as compared to pigments?
\end{itemize}
