Physics/Review.org
*** General
$\theta = \frac12 \alpha t^2$ \\
$\omega_f^2=\omega^2 + 2\alpha \theta$ \\
$\alpha = \omega / t$ \\
$\omega = \theta /t$ \\
** Graphs
** Practice Problems
- How are the rotational motion terms defined?  What is a radian?  How do we measure rotational motion quantities?
- What is torque in all of its complexity?
- What is the center of mass of an object?  How can multiple objects have a center of mass? How can you find the center of mass?
- Why do things balance?  How is balancing related to torque?
- How does net torque relate to net force?
- How does the torque on an object relate to the rotational acceleration of an object?
- How does a pulley work when we include the rotation/torque on the pulley?
- Why does a ball roll down a hill and a box does not?
- How does the shape of a round object affect its ability to roll down a hill?  Which shape is the best for rolling down a hill in terms of speed?
