Physics/Review.html
<div id="outline-container-org4a821c4" class="outline-2">
<h2 id="org4a821c4">Rotation</h2>
<div class="outline-text-2" id="text-org4a821c4">
</div>
<div id="outline-container-org1fd4214" class="outline-3">
<h3 id="org1fd4214">Equations</h3>
<div class="outline-text-3" id="text-org1fd4214">
</div>
<ul class="org-ul">
<li><a id="orgcd79e3f"></a>Torque<br />
<div class="outline-text-4" id="text-orgcd79e3f">
<p>
\(\tau=Fr\sin(\theta)\) <br />
\(\tau=I\alpha\) <br />
\(I=kmR^2\) <br />
</p>
</div>
</li>
<li><a id="orgcac6a8a"></a>Connecting<br />
<div class="outline-text-4" id="text-orgcac6a8a">
<p>
\(x=R\theta\) <br />
\(v=R\omega\) <br />
\(a=R\alpha\) <br />
</p>
</div>
</li>
<li><a id="orgeacd707"></a>General<br />
<div class="outline-text-4" id="text-orgeacd707">
<p>
\(\theta = \frac12 \alpha t^2\) <br />
\(\omega_f^2=\omega^2 + 2\alpha \theta\) <br />
\(\alpha = \omega / t\) <br />
\(\omega = \theta /t\) <br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org62cbe58" class="outline-3">
<h3 id="org62cbe58">Graphs</h3>
</div>
<div id="outline-container-orga80a1b7" class="outline-3">
<h3 id="orga80a1b7">Practice Problems</h3>
<div class="outline-text-3" id="text-orga80a1b7">
<ul class="org-ul">
<li>How are the rotational motion terms defined?  What is a radian?  How do we measure rotational motion quantities?</li>
<li>What is torque in all of its complexity?</li>
<li>What is the center of mass of an object?  How can multiple objects have a center of mass? How can you find the center of mass?</li>
<li>Why do things balance?  How is balancing related to torque?</li>
<li>How does net torque relate to net force?</li>
<li>How does the torque on an object relate to the rotational acceleration of an object?</li>
<li>How does a pulley work when we include the rotation/torque on the pulley?</li>
<li>Why does a ball roll down a hill and a box does not?</li>
<li>How does the shape of a round object affect its ability to roll down a hill?  Which shape is the best for rolling down a hill in terms of speed?</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Burns</p>
<p class="date">Created: 2021-04-23 Fri 10:57</p>
</div>
</body>
</html>
