Physics/Review.tex
\section*{Rotation}
\label{sec:orgb5a4325}
\subsection*{Equations}
\label{sec:org693fc35}
\begin{itemize}
\item Torque
\label{sec:org255e28e}
\(\tau=Fr\sin(\theta)\) \\
\(\tau=I\alpha\) \\
\(I=kmR^2\) \\
\item Connecting
\label{sec:org1932310}
\(x=R\theta\) \\
\(v=R\omega\) \\
\(a=R\alpha\) \\
\item General
\label{sec:org930f718}
\(\theta = \frac12 \alpha t^2\) \\
\(\omega_f^2=\omega^2 + 2\alpha \theta\) \\
\(\alpha = \omega / t\) \\
\(\omega = \theta /t\) \\
\end{itemize}
\subsection*{Graphs}
\label{sec:org64e473d}
\subsection*{Practice Problems}
\label{sec:org451f506}
\begin{itemize}
\item How are the rotational motion terms defined?  What is a radian?  How do we measure rotational motion quantities?
\item What is torque in all of its complexity?
\item What is the center of mass of an object?  How can multiple objects have a center of mass? How can you find the center of mass?
\item Why do things balance?  How is balancing related to torque?
\item How does net torque relate to net force?
\item How does the torque on an object relate to the rotational acceleration of an object?
\item How does a pulley work when we include the rotation/torque on the pulley?
\item Why does a ball roll down a hill and a box does not?
\item How does the shape of a round object affect its ability to roll down a hill?  Which shape is the best for rolling down a hill in terms of speed?
\end{itemize}
\end{document}
